#+title: Valuing Contracts with Multiple Cash Flows
#+author: Matt Brigida, Ph.D.
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup


In this presentation, we'll look at the valuation of contracts that are comprised of multiple cash flows. We'll cover the following:

- Annuities
- Perpetuities
- Growing Annuities and Perpetuities 
- Irregular Cash Flows

** Python calculation

#+BEGIN_SRC python :results output :exports both
def present_value_annuity(C, rate, periods):
    return C * (1 - 1 / pow(1 + rate, periods)) / rate

C = 100
rate = 0.07
periods = 10

print(round(present_value_annuity(C, rate, periods), 2))

#+END_SRC

#+RESULTS:
: 702.36


** Python calculation

#+BEGIN_SRC python :results output :exports both
def cash_flow_per_period(pva, rate, periods):
    return C * (1 - 1 / pow(1 + rate, periods)) / rate

C = 100
rate = 0.07
periods = 10

print(round(present_value_annuity(C, rate, periods), 2))

#+END_SRC

#+RESULTS:
: 702.36



 
* Solving for r in the PV of an Annuity 
  
To solve for $r$ we need to find the root of an $n$ degree polynomial, which we can do with an optimizer (such as in the example below or using ==IRR()= in Excel, which both use the Newton-Raphson algorithm).

#+BEGIN_SRC python :results output :exports both
from scipy import optimize

C = 100
years = 10
annuity_present_value = 702.36 

def eq(YTM):
    return(C * (1 - 1 / pow(1 + YTM, years)) / YTM - annuity_present_value)
    
root = optimize.newton(eq, 0.1) ## 0.1 is our initial guess

print("The rate per period is: ", round(root * 100, 2), "%")
#+END_SRC

#+RESULTS:
: The rate per period is:  7.0 %




** C++ Calculation

#+BEGIN_SRC C++ :results output :exports both
  #include <cmath>
  #include <iostream>
  using namespace std;

  double future_value_annuity(double c, double rate, double periods){
  return(c * (pow((1 + rate), periods) - 1) / rate);
  }

  double C = 100;
  double rate = 0.07;
  double periods = 10;

  int main(){
  double ans = future_value_annuity(C, rate, periods);
  cout << ans;
   return 0;
  }
#+END_SRC

#+RESULTS:
: 1381.64


 

